package com.atguigu.chapter03

object $01_Operator {

  /**
    * java中运算符：
    *   1、算数运算符: +、-、*、/、% ++ --
    *   2、比较运算符: > < >= <= != ==
    *   3、逻辑运算符: && || !
    *   4、赋值运算符: = += -= *= /=
    *   5、位运算符: < > & | >>
    *   6、三元运算符: 逻辑表达式? 表达式1: 表达式2
    *
    * scala中没有三元运算符，如果想要实现三元运算符可以通过if-else做
    * scala没有++、--运算符。
    * scala中运算符:
    *   1、算数运算符: +、-、*、/、%
    *   2、比较运算符: > < >= <= != ==
    *   3、逻辑运算符: && || !
    *   4、赋值运算符: = += -= *= /=
    *   5、位运算符: < > & | >>
    *
    * scala中运算符都是方法。
    */
  def main(args: Array[String]): Unit = {

    val a = 10
    val c = a + 20
    val d = a.+(20)
    println(d)
  }
}
